In [1]:
import pandas as pd

titanic = pd.read_csv('data/titanic.csv')

In [ ]:
titanic

In [ ]:
titanic.head(3)

In [ ]:
titanic.tail(1)

In [ ]:
titanic.dtypes

In [ ]:
titanic.to_excel('data/titanic.xlsx', sheet_name='passengers', index=False)

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
ages = titanic['Age']
ages.head()

In [2]:
type(titanic['Age'])

pandas.core.series.Series

In [4]:
titanic['Age'].shape

(891,)

In [5]:
age_sex = titanic[["Age", "Sex"]]

In [6]:
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [7]:
type(titanic[["Age", "Sex"]])

pandas.core.frame.DataFrame

In [8]:
titanic[["Age", "Sex"]].shape

(891, 2)

In [15]:
above_35 = titanic[titanic['Age'] == 35]

In [16]:
above_35.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.000,NaN,S
211,212,1,2,"Cameron, Miss. Clear Annie",female,35.0,0,0,F.C.C. 13528,21.000,NaN,S
230,231,1,1,"Harris, Mrs. Henry Birkhardt (Irene Wallach)",female,35.0,1,0,36973,83.475,C83,S

In [14]:
titanic["Age"] > 35

0      False
1       True
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool